app/controllers/admin_users_controller.rb

	def show
		@admin_user = AdminUser.find(params[:id])
---
SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def create
		@admin_user = AdminUser.new(admin_user_params)
		if @admin_user.save
---
INSERT INTO "admin_users" ("first_name", "last_name", "section", "roll_number", "year", "email", "username", "password_digest", "superuser", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def edit
		@admin_user = AdminUser.find(params[:id])
---
SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def delete
		@admin_user = AdminUser.find(params[:id])
---
SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]