app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT "questions".* FROM "questions" ORDER BY timestamp

  def create
    @question = Question.new(:description=> params[:question][:description], :answer => params[:question][:answer], :one => params[:question][:one], :two => params[:question][:two], :three => params[:question][:three])
    if @question.save
---
INSERT INTO "questions" ("description", "answer", "one", "two", "three", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["description", "this is my question"], ["answer", "pant"], ["one", "p1"], ["two", "khuo"], ["three", "jloi"], ["created_at", 2017-03-03 08:33:07 UTC], ["updated_at", 2017-03-03 08:33:07 UTC]]

  def update
    @question = Question.find(params[:id])
    if @question.update_attributes(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "questions" SET "three" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["three", "pant"], ["updated_at", 2017-03-03 08:56:31 UTC], ["id", 2]]

  def delete
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]